Diplom/src/Documents/BKM_ГрафикОтпусков/BKM_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.BKM_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.BKM_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/BKM_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ОтпускаСотрудниковПриИзмененииНаСервере();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьСотрудниками(Команда) 
	
	Если Объект.ОтпускаСотрудников.Количество() <> 0  Тогда
		
		Результат = Ждать ВопросАсинх("Список сотрудников будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;
	
	Объект.ОтпускаСотрудников.Очистить();
	ЗаполнитьСотрудникамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	ОткрытьФорму("Документ.BKM_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект);   	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокОтпусков.Сотрудник КАК Сотрудник,
		|	СписокОтпусков.НомерСтроки КАК НомерСтроки,
		|	РАЗНОСТЬДАТ(СписокОтпусков.ДатаНачала, СписокОтпусков.ДатаОкончания, ДЕНЬ) + 1 КАК ОбщаяПродолжительностьОтпуска
		|ПОМЕСТИТЬ ВТ_СписокОтпусков
		|ИЗ
		|	&СписокОтпусков КАК СписокОтпусков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокОтпусков.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_СписокОтпусков.ОбщаяПродолжительностьОтпуска) КАК ОбщаяПродолжительностьОтпуска
		|ПОМЕСТИТЬ ВТ_СписокСгруппированный
		|ИЗ
		|	ВТ_СписокОтпусков КАК ВТ_СписокОтпусков
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписокОтпусков.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокОтпусков.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВТ_СписокСгруппированный.ОбщаяПродолжительностьОтпуска, 0) КАК ОбщаяПродолжительностьОтпуска
		|ИЗ
		|	ВТ_СписокОтпусков КАК ВТ_СписокОтпусков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокСгруппированный КАК ВТ_СписокСгруппированный
		|		ПО ВТ_СписокОтпусков.Сотрудник = ВТ_СписокСгруппированный.Сотрудник";
	
	
	СписокОтпусков = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник,НомерСтроки,ДатаНачала,ДатаОкончания" );
	Запрос.УстановитьПараметр("СписокОтпусков",СписокОтпусков);
	
	ТаблицаОтпусков = Запрос.Выполнить().Выбрать();   
	
		
	Пока ТаблицаОтпусков.Следующий() Цикл
		
		Объект.ОтпускаСотрудников[ТаблицаОтпусков.НомерСтроки - 1].ОбщаяПродолжительностьОтпуска = ТаблицаОтпусков.ОбщаяПродолжительностьОтпуска;
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаСервере                                       
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);  
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьСотрудникамиНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.BKM_Сотрудники КАК BKM_Сотрудники
		|ГДЕ
		|	НЕ BKM_Сотрудники.ПометкаУдаления";
	
	СписокСотрудников = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СписокСотрудников,Объект.ОтпускаСотрудников);
	
КонецПроцедуры


#КонецОбласти
